[{"jobId":"300424011028","jobTitle":"Sap Basis Consultant","companyName":"News Technology Services","description":"<p>  </p><p><strong>Equal Opportunity Employer</strong></p><p>All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, protected veteran status, or disability status. EEO/AA/M/F/Disabled/Vets</p><br /><p><strong>Job Title: SAP Basis consultant</strong></p><p><strong>Job Location: Bengaluru, Karnataka</strong></p><p><strong>Work Arrangement: Hybrid (3 days per week in office)</strong></p><br /><p><strong>Summary:</strong></p><p>We have an excellent opportunity in News Corp India, Bangalore location, for the position of an experienced SAP Basis Consultant. We are looking for a well experienced resource who has excellent knowledge in administrating various SAP system landscapes such as S4 Hana, PI/PO, BI, BW, and Solution Manager Etc. The role will involve the management and administration of SAP landscape and technologies used by the Business units in News Corp by effectively collaborating with various vendors who supports the same.</p><br /><p><strong>Roles and Responsibilities:</strong></p><p>Implement and maintain the multiple SAP instances that comprise the SAP environment (development, test, training and production).</p><p>Maintain SAP performance by planning and executing SAP tuning strategies.</p><p>Monitor all SAP systems (work processes, users, system logs, short dumps, locks, developer traces, system traces, disk space, etc.) proactively</p><p>Perform SAP client administration (create client, copy client, delete client, export/import client) as required.</p><p>Perform periodic SAP system refreshes of non-Production systems with Production data</p><p>Work closely with Infrastructure team in planning and executing Infra upgrades and patching</p><p>Participate in the planning and implementation of SAP system upgrades.</p><p>Apply and migrate SAP maintenance (hot packages and kernel upgrades) through all systems using a structured methodology.</p><p>Develop and maintain system documentation for all SAP instances and interfaces.</p><p>Introduce technical changes into the environment using a structured approach that minimizes risk and achieves high reliability, availability and performance of each SAP instance.</p><p>Design and implement an optimal SAP configuration to maximize system performance and availability.</p><p>Distribute the online SAP user workload and monitor and manage the SAP background job workload.</p><p>Monthly production deployment of Business changes and fixes using Solution Manager Change Request Management</p><p>Troubleshooting of the various SAP performance and configuration issues reported</p><p>Coordinate with internal stakeholders, different teams and vendors as required for supporting the SAP landscapes</p><p>Support annual disaster recovery testing</p><br /><p><strong>Skill and Experience:</strong></p><p>Proven working and hands on experience with 5 or more years in SAP Basis administration of different SAP modules like S4 Hana, ERP, PI/PO, BI, BW, Solution Manager</p><p>Deep level of knowledge on SAP basis components</p><p>Previous experience in supporting finance systems like FICA, FICO, BPC, etc.</p><p>Experience is SAP implementations</p><p>Good experience in SAP upgrades, kernel patching, add-on installations</p><p>Experience in configuring and working with Solution Manager 7.2 features such as ChaRM, Solution Documentation, Technical Monitoring etc.</p><p>Experience in SAP system copies and refreshes</p><p>Good Knowledge in configuring and managing archiving setup</p><p>Experienced in supporting various connector & cloud integrations to third party systems like Concur</p><p>Knowledge in cloud based SAP deployments like in AWS cloud</p><p>Deep level of knowledge on HA/DR technologies including design and implementation of Geographically Dispersed HA/DR solutions</p><p>Hana, Sybase Database administration knowledge</p><p>Experience with deploying Single Sign On for various SAP components and integrations to third party using authentication services based on SAML2</p><p>Technical and configuration experience in business objects, Fiori etc.</p><p>Good working knowledge on integration technologies like AIF and SAP Process Orchestration as well as connectivity protocols for sFTP, web services etc.</p><p>Highly self-motivated, work ethic driven with keen attention to detail and exceptional customer orientation</p><p>Strong analytical skills; ability to perform complex systems analysis and draw conclusions by relating information from different sources, including root-cause analysis and issue resolution</p><p>Strong stakeholder management, communication and interpersonal skills</p><p>SAP certification in basis administration is desirable.</p><p>Have an insatiable thirst to be successful and motivation to make it all happen</p><p>You are resourceful and like to research everything</p><p>Have an insatiable thirst to be successful and motivation to make it all happen</p>","minimumSalary":800000,"maximumSalary":1200000},{"jobId":"180624009285","jobTitle":"Sap Basis Consultant","companyName":"Infosys","description":"<p> </p><p><strong><u>Roles & Responsibilities: </u></strong></p><br /><p>day in the life of an Infoscion</p><br /><ul><li> As part of the Infosys consulting team, your primary role would be to lead the engagement effort of providing high-quality and value-adding consulting solutions to customers at different stages- from problem definition to diagnosis to solution design, development and deployment.</li><li> You will review the proposals prepared by consultants, provide guidance, and analyze the solutions defined for the client business problems to identify any potential risks and issues. </li><li> You will identify change Management requirements and propose a structured approach to client for managing the change using multiple communication mechanisms. </li><li> You will also coach and create a vision for the team, provide subject matter training for your focus areas, motivate and inspire team members through effective and timely feedback and recognition for high performance. </li><li> You would be a key contributor in unit-level and organizational initiatives with an objective of providing high-quality, value-adding consulting solutions to customers adhering to the guidelines and processes of the organization. </li></ul><p>If you think you fit right in to help our clients navigate their next in their digital transformation journey, this is the place for you!</p><br /><p><strong><u>Technical Requirement:</u></strong></p><br /><ul><li>SAP Basis administrator</li><li>SAP Basis</li><li>SAP Basis HANA</li></ul><br /><p><strong><u>Additional information:</u></strong></p><p>Location of posting - Infosys Ltd. is committed to ensuring you have the best experience throughout your journey with us. </p><p><strong>We currently have open positions in a number of locations across India - Bangalore, Pune, Hyderabad, Chennai, Chandigarh, Trivandrum, Indore, Nagpur, Mangalore, Noida, Bhubaneswar, Kolkata, Coimbatore, Mumbai, Jaipur. </strong></p><p>While we work in accordance with business requirements, we shall strive to offer you the location of your choice, where possible.</p><ul><li> Good knowledge on software configuration management systems</li><li> Strong business acumen, strategy and cross-industry thought leadership</li><li> Awareness of latest technologies and Industry trends</li><li> Logical thinking and problem-solving skills along with an ability to collaborate</li><li> Two or three industry domain knowledge </li><li> Understanding of the financial processes for various types of projects and the various pricing models available</li><li> Client Interfacing skills</li><li> Knowledge of SDLC and agile methodologies </li><li> Project and Team management</li></ul>","minimumSalary":800000,"maximumSalary":1800000},{"jobId":"050624011079","jobTitle":"Sap Basis Consultant","companyName":"Sonata Software","description":"<p><strong>Role & responsibilities</strong> </p><br /><br /><p> </p><ul><li>        Good understanding of SAP administration with a minimum of 3 years of experience</li><li>        Understanding of SAP maintenance and administration tools, including HANA Cockpit/Studio, SUM, SPAM/SAINT and S-Note</li><li>        Basic Know-How in HANA and DB2 database support. Optional Know-How in Oracle.</li><li>        Handling of Linux shell environments</li></ul><p>Tasks:</p><ul><li>        Dispatch, evaluate and handle incidents, monitoring alerts and requests from other support teams</li><li>        Keeping track of service level agreements, especially for the internal ticket backlog</li><li>        Implement SAP support packages and feature packs, security notes and addons</li><li>        Perform OS patches for Linux environment</li><li>        Validation of system configuration to ensure audit and security requirements</li><li>        S4/HANA system installations according to documentation</li></ul><p>Tasks:</p><ul><li>        Daily monitoring of batch jobs in Solman</li><li>        Daily monitoring and handling of UC4-jobs (restarting, check for long runners, etc.)</li><li>        Processing the releases for all ChaRM landscapes (Stuart, Paradis, Treasury) on a regular basis</li><li>        Daily monitoring of all ChaRM landscapes (check for any issues here like import errors, missing imports, etc.)</li><li>        Processing of non-complex user request tickets in Solman</li><li>        Individual tasks in user management (do evaluations, cross-system-checks, housekeeping, master data maintenance, etc.)</li><li>        Process OSS-user/SSCR-key requests</li><li>        Monitoring and handling of OSS-related tasks (open system, check users, check schedules, etc.)</li><li></li><li></li></ul><p>  </p><p><strong><em>About Sonata Software</em></strong></p><p><strong><em>In today's market, we observe a distinct duality in technology adoption. On one front, clients are keenly focused on cost containment, while on the other, there is a strong drive to modernize their digital storefronts, aiming to appeal to both consumers and B2B customers alike.</em></strong></p><p><strong><em>As a leading Modernization Engineering company, we aim to deliver modernization-driven hypergrowth for our clients based on the deep differentiation we have created in Modernization Engineering, powered by our Lightening suite and 16-step Platformation playbook. In addition, we bring agility and systems thinking to accelerate time to market for our clients.</em></strong></p><p><strong><em>Headquartered in Bengaluru, India, Sonata Software has a strong global presence, with strategic operations spanning across key regions such as the US, UK, Europe, APAC, and ANZ. We are a trusted partner of world-leading companies in TMT (Telecom, Media, and Technology), Retail & CPG, Manufacturing, BFSI (Banking, Financial Services and Insurance), and HLS (Healthcare and Lifesciences). Our bouquet of Modernization Engineering services cuts across Cloud, Data, Dynamics, Contact Centers, and around newer technologies like Generative AI, MS Fabric, and other modernization platforms.</em></strong></p><p><strong><em>To know more, visit: www.sonata-software.com</em></strong></p>","minimumSalary":800000,"maximumSalary":1400000},{"jobId":"010624005191","jobTitle":"Sap Basis Administrator","companyName":"Abhiyanta India Solutions","description":"<p> </p><ul><li>SAP Basis - Strong knowledge and Hands on experience on Technical Planning, Operation ,Installation, Upgrades ,Migration. </li><li>Must have Database Knowledge of Oracle & HANA. </li><li>Must Have  2 E2E Implementations, 1 OS/DB Migration , 1 Upgrade </li><li>Must Have  Good Knowledge on Solman 7.2  </li><li>Advantages – Experience on S/4 Migration , DR Setup, ITSM/CHARM/BPMON Implementation. </li><li>Should be open to travel as per project requirement . </li><li>Ability to Install ,configure, maintain and support diverse SAP Landscape(Like S4HANA,ECC,BW,BI,Solman,PO,Fiori) </li><li>Technically fluent in operating System (Unix/Windows/Linux),Database (SAP ASE Oracle/DB2 SQL Server/HANA) Administration. </li><li>Knowledge/Experience in performance tuning ,User Management System copies, Client copies. </li><li>Install patches and Bug Fixes for SAP Application and Database. </li><li>System refreshes, Kernel Upgrades, Support Package Upgrades, Patch Upgrade, DB Upgrades, SNOTE Implementation, Job Scheduling, Printer Management etc. </li><li>Ability to troubleshoot/analyze and resolve technical problem. </li><li>Ability to work on activities involved in plan areas (Sizing ,Scoping, Client/Landscape Strategy ,High Availability /Disaster Recovery Strategy  etc.)of Implementation projects without much supervision at transaction level. </li><li>Manage the change management processes within the SAP Landscape and the SAP Infrastructure according to accepted policy and procedure. </li><li>Provide technical expertise for resolving escalated issues. Participate in crisis resolution  meetings as necessary. </li><li>Collaborate with functional teams on the integration and support of the SAP System and new initiatives. </li><li>Automale administrative and operational systems support functions. Provide training and direction to other operational support teams. </li><li>Maintain documentation on system configuration ,maintenance processes and schedule. </li><li>Monitor performance as it relates  to SAP infrastructure and enterprise continuity/disaster recovery procedures for SAP technologies. </li><li>Perform release and patch activities and participate in overall upgrade improvements to systems and hardware. </li><li>Ensure adherence  to regulatory and compliance requirements  within SAP systems Infrastructure and Architecture. </li><li>Participate in providing 24 * 7 support on rotational basis to ensure operations of these critical systems for different customers. </li><li>Flexibility in working all the shifts according to the requirement . </li><li>Support IT audit activities ,analyze results and provide remediation which result in improved compliance to standards and controls for al internal and external regulatory requirements.  </li><li>8 or more years of experience managing SAP technologies as a basis  administrator in a medium or large size firm. </li><li>8 years of experience in SAP BASIS in multiple applications S4HANA, ECC,BW,PO(Process orchestration), Solution Manager and others. </li><li>Ability to handle escalations and follow Escalation Matrix ,when required. </li><li>Ability to prioritize tasks, work independently and proceed with objectives with minimum supervision. </li><li>Must have strong technical foundation and strong problem solving skills. </li><li>Understanding of SOX IT General controls. </li><li>Proficient understanding of SAP technologies and applications. </li><li>ITIL process experience. </li><li>A mandatory condition of SAP Certification. </li><li><strong><u><em>It should be the latest Private or Public Cloud Certification</em></u></strong> </li></ul><br /><p>Interested Resources Can Share Your Profiles -  vidya.d@abhiyantatech.com</p><p>                                                                                     poojav@abhiyantatech.com</p>","minimumSalary":400000,"maximumSalary":900000},{"jobId":"100624003689","jobTitle":"Sap Basis Administrator","companyName":"Relevantz Technology Services","description":"<p><strong>Greetings from Relevantz!</strong></p><p><br /><strong>Job Title: SAP BASIS Administrator</strong></p><p><strong>Location: Bangalore</strong><br /><br /><strong>Job Description:</strong><br /><strong>Responsibilities:</strong><br /><br /></p><ul><li>Good knowledge of SAP systems and its component.</li><li>Assist in the maintenance, and administration of SAP system Landscape.</li><li>Experience of handling Support Pack Upgrades.</li><li>Should have experience with system refreshes.</li><li>Troubleshooting system performance issues and providing solutions.</li><li>Troubleshooting transport issues.</li><li>Sound hands-on knowledge on Oracle database.</li><li>Collaborate with cross-functional teams to support various projects, contributing fresh perspectives and innovative ideas.</li><li>IT Incident and Change management experience.</li><li>Experience of working in a sensitive IT environment / domain.</li><li>Must be willing to work in afternoon IST shifts (Shift starting between 12PM to 3 PM)</li></ul><p><br />Interested can share your resume at rajesh.venkatesh@relevantz.com</p>","minimumSalary":1000000,"maximumSalary":1200000},{"jobId":"120624906926","jobTitle":"SAP Basis Consultant - Support & Implementation","companyName":"Mobile Programming","description":"<p>We are looking for <b>SAP Basis Consultant</b> provides technical support and leadership on SAP Basis systems including establishing standards and requirements, evaluating and directing enhancements, and implementing solutions for performance monitoring, and systems configuration, design and implementation.<b><br /><br /></b><b>Responsibilities and Requirements :</b><br /><br />- Between 2 to 5 years of experience in managing SAP Intelligent Suite Systems, Comprehensive<br /><br />- Knowledge in OS & DB administration.<br /><br />- Support of the SAP Basis Administration for SAP ERP, SAP NetWeaver, SAP Enterprise Portal, SAP<br /><br />- Solution Manager, and SAP Web Dispatcher.<br /><br />- Should be able to independently handle issues and provide solutions by taking the ownership of the<br />assigned task/activities.<br /><br />Essential Technical Skill Set:<br /><br />- Expertise in Administration of SAP Systems such as S/4 HANA, BW/4 HANA, Fiori/Gateway systems, SAP NetWeaver, SAP Enterprise Portal and SAP Web Dispatcher<br /><br />- Expertise in Managing Complex Production Landscape Systems (SAP S/4 HANA, BW/4 HANA, PO,<br />BO, Hybris, Solman 7.2)<br /><br />- Should have worked on managing Business Continuity Solutions such as HA / DR Failover Solutions for SAP landscapes<br /><br />- Should have deep dive knowledge in Database Administration of SAP HANA and Oracle, including DB Patching, DB related performance tuning, sizing and storage/disk designing<br /><br />- Strong knowledge of Linux and Aix operating systems<br /><br />- Should have exposure to New SAP releases, enhancements, new functionality and application research<br /><br />- Strong knowledge in SAP Security Hardening<br /><br />Added Advantages :<br /><br />- Experience on Installation and maintenance of SAP and SAP related software products<br /><br />- SAP Version/EHP Upgrades or OS/DB Migrations on Hybrid Environments<br /><br />- SAP and DB performance analysis and Tuning<br /><b><br />Essential Interpersonal Skillset :</b><br /><br />- Effective Communication & Presentation skills is must<br /><br />- Should be able to work independently<br /><br />- Good analytical and problem-solving skills<br /><br />- Good interpersonal and customer care skills<br /><br />- Should be flexible to extend support to meet Project / Delivery timelines<br /><br />- Willing to work in night/rotational shifts<br /><br /><b>Qualifications :</b><br /><br />- B.E; MCA; MBA; Any professional Degree\"</p><p><span>Location: Delhi NCR,Bangalore,Chennai,Pune,Kolkata,Ahmedabad,Mumbai,Hyderabad</span></p>","minimumSalary":800000,"maximumSalary":1400000},{"jobId":"050624009607","jobTitle":"SAP security and GRC consultant","companyName":"Sonata Encore Software Services","description":"<br /><p><strong>SAP Security administrator with 4 to 6 years of experience with the below:</strong></p><ul><li>Work directly with clients at all different levels to guide complex projects and develop innovative solutions.</li><li>Successful completion of at least full life cycle implementations/Upgrade of SAP GRC, ERP,S4HANA.</li><li>Role design, configuration, testing, and deployment methodology within SAP application architecture.</li><li>Detailed knowledge of ABAP and Java based authorizations within SAP applications.</li><li>SAP S/4 HANA Profile Generator (single roles, master / derived roles, composite roles).</li><li>Technical expertise in core skills of SAP BI 7.0 security analysis authorization concept.</li><li>SAP GRC 12.0 configuration and administration.</li><li>SAP Enterprise Portal UME administration.</li><li>Experience in CHARM Process and role build.</li><li>Strong communication skills to facilitate working in a dynamic project environment.</li><li>Provide leadership to junior systems analysts and client personnel assigned to projects.</li><li>Good communication and interpersonal skills </li></ul><br /><p>Notice period: Immediate</p><p>Interested candidate with suitable skillset kindly share your resume to ybalakrishnan@sonata-software.com</p><br /><p> </p><p>Best Regards,</p><p><strong>Yamini Balakrishnan</strong></p>","minimumSalary":800000,"maximumSalary":1300000},{"jobId":"280524904386","jobTitle":"SAP Technical Consultant","companyName":"Strategic Skill Tech","description":"<p>-Overall Core experience on SAP Business One SDK using VB.net and HANA Service<br />Layer<br />- Hands on development experience in handling 3 Complete Addon Developments.</p><p>Responsibilities:<br />-Install, configure, and maintain SAP systems (hardware and software) according to best practices.<br />-Manage user accounts, security settings, and system permissions.<br />-Implement system upgrades and patches to ensure functionality and security.<br />-Perform backups and disaster recovery procedures to safeguard system data.<br />-Possess in-depth knowledge of SAP technical components, including databases (often SAP HANA), operating systems, and network configurations.<br />-Experience with SAP Basis administration is highly desirable.<br />-Familiarity with SAP modules relevant to the company's needs (e.g., Finance (FICO), Sales & Distribution (SD), Production Planning (PP)).</p>","minimumSalary":1200000,"maximumSalary":1600000},{"jobId":"210624010540","jobTitle":"SAP Basis Hana | 4 To 9 years | Bengaluru, Mumbai, Hyderabad & Pune","companyName":"Capgemini","description":"<p> <strong>Experience Required</strong> </p><ul><li>Candidate should have overall of 4 to 9 years with relevant hands on consulting experience in SAP BASIS HANA. </li><li>Must have done 1 2 end to end implementation and 2 3 Support project.</li></ul><br /><p><strong>Primary Skills:</strong></p><p><strong>SAP BASIS HANA Experience.</strong> </p><ul><li>Hands on experience in End to End Implementations and support operations. </li><li>Demonstrate a proven ability to support SAP Basis on latest versions of SAP ECC and      S4Hana. </li><li>Should have hand on experience in SAP HANA S 4 HANA SAP ECC6 0 SAP NetWeaver Administration. </li><li>Must have HANA DB refresh and system refresh hands on experience. </li><li>Must be able to perform independently all standard SAP Basis Administrator duties including patches system copies user administration printer setup batch job scheduling and other ongoing duties. </li><li>Good experience in Operations and Monitoring. </li><li>At least 2 years of experience in any one of the Hyperscaler area AWS GCP AWS. </li><li>Work experience in SAP Private Cloud SAP BTP Administration CPI Integration suite and CloudALM monitoring. </li><li>Good to have interface architecture knowledge with one or more on premises SaaS packaged solutions. </li><li>Know how and Know what about SAP interface technologies SAP Gateway RFC BAPI IDOC. </li><li>Responsible for SAP Cloud Connector SAP Web dispatcher administration. </li><li>Must be proficient in supporting SAP interfaces batch job functionalities SSL renewal SNC SSO. </li><li>Must have SAP Installation and upgrade experience on both ABAP and Java stack. </li><li>Responsible to analyze customer needs document requirements and design technical      solutions. </li><li>Ability to manage multiple tasks work in a team environment understand and be      responsive to project and customer needs. </li><li>HANA Hardware Sizing capabilities DR Capabilities. </li><li>Ability to work with multiple ongoing projects which are at different stages coordinating. </li><li>Solid background in technical analysis and requirements gathering and solid      understanding of the SAP. </li><li>Perform complex problem analysis providing an advanced level of application and end user support. </li><li>Perform application monitoring troubleshooting and tuning to ensure high availability and      performance standards are met. </li><li>Experience in SAP application capacity Planning performance tuning. </li><li>SAP certification in SAP Basis is preferred. </li></ul><br /><p><strong>Secondary Skills:</strong></p><ul><li>Must have a deep strong understanding of SAP BASIS HANA BTP module. </li><li>Should be able to analyze client business processes gather requirements  maintain data mapping document of interfaces conversions. </li><li>Must be skilled in user support troubleshooting and error resolution. </li><li>Strong written and communication skills able to interact with technical consultants as well as business partners. </li><li>Will be responsible for managing team and production support roll out. </li><li>Required Strong Knowledge on Implementation and Acquisitions experience in SAP. </li><li>Good Business process understanding. </li><li>Should have hands on experience in SAP Best practices. </li><li>Should be able to design and configure business scenarios. </li><li>Should be able to interact with business users in defining and finalizing requirements. </li><li>Basic Debugging skills would be an advantage. </li><li>Developing functional specifications for new developments change requests. </li><li>Must have hands on experience in preparing functional specification documents for changes and enhancements. </li><li>Should have strong communication and team management skills. </li><li>Ability to work independently and carry out assignments to completion within parameters of instructions given prescribed routines and standard accepted practices.</li></ul><br /><br />","minimumSalary":1500000,"maximumSalary":3000000},{"jobId":"300524011645","jobTitle":"Sap Basis","companyName":"Tata Consultancy Services (TCS)","description":"<p> </p><p><strong>Greetings from TCS !!!</strong></p><br /><br /><p><strong>Job Title: SAP Basis</strong></p><p><strong>Location: PAN India</strong></p><p><strong>Experience Range: 4 -12 Years</strong></p><br /><p><strong>Job Details</strong></p><p><strong>MUST HAVE SKILLS</strong></p><br /><ul><li>Installation and maintenance of various SAP products.</li><li>Ability to implement management techniques, table partition, compression techniques and SQL performance optimization</li><li>Should have worked on OS/DB migration</li><li>Participate in planning and upgrade of SAP systems</li><li>Perform SAP refresh activities</li><li>Maintain the integrity of SAP environment by managing CTS.</li><li>Apply Support packs and perform kernel upgrade</li><li>Should have knowledge of backup/recovery tools</li><li>Distribute the SAP user workload and monitor and manage the SAP background job workload</li><li>Maintain performance of SAP systems by planning and executing SAP tuning strategies</li><li>Perform health check of all SAP systems</li><li>Perform SAP client administration (create/copy/delete) as required</li><li>Develop and maintain system documentation for all SAP instances</li></ul><br />","minimumSalary":900000,"maximumSalary":1900000},{"jobId":"250224002095","jobTitle":"TS - SAP Basis HANA Developer or Consultant","companyName":"Srivango","description":"•\tArchiving financial data and config.<br>•\tStrong technical and problem-solving skills. <br>•\tManage and maintain SAP Basis support services.<br>•\tConfigure, implement, and optimize SAP systems.<br>•\tManage incidents, problems, changes, and releases,","minimumSalary":1500000,"maximumSalary":3000000}]